# Задача 22: Даны два неупорядоченных набора целых чисел (может быть, с повторениями). 
# Выдать без повторений в порядке возрастания все те числа, которые встречаются в обоих наборах.
# Пользователь вводит 2 числа. n — кол-во элементов первого множества. m — кол-во элементов второго множества. 
# Затем пользователь вводит сами элементы множеств.

mas1 = [4,2,5,6,8,1,5]
mas2 = [3,8,2,9,4,6,1]

print(set(mas1).intersection(set(mas2)))